Repository: W0nderful11/Industrial
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: kk

source: 🏠 Главная
kk: 🏠 Басты

source: ⬅️ Назад
kk: ⬅️ Артқа

source: 🔙 Назад
kk: 🔙 Артқа

source: Назад
kk: Артқа

source: ⬅️ Назад к списку
kk: ⬅️ Тізімге қайту

source: Назад ◀️
kk: Артқа ◀️

source: Назад в админ панель
kk: Админ панельге қайту

source: ❌ Отменить
kk: ❌ Болдырмау

source: ❌ Нет, отменить
kk: ❌ Жоқ, болдырмау

source: ✅ Подтвердить
kk: ✅ Растау

source: ✅ Успешно
kk: ✅ Сәтті

source: ✅ Анализ успешно удален
kk: ✅ Талдау сәтті жойылды

source: Ошибка: бот недоступен
kk: Қате: бот қолжетімсіз

source: Ошибка: сервис временно недоступен
kk: Қате: сервис уақытша қолжетімсіз

source: ❌ Сервис временно недоступен
kk: ❌ Сервис уақытша қолжетімсіз

source: ❌ Произошла ошибка
kk: ❌ Қате орын алды

source: ❌ Произошла ошибка при удалении
kk: ❌ Жою кезінде қате орын алды

source: ❌ Ошибка при отправке
kk: ❌ Жіберу кезінде қате

source: ❌ Ошибка при переключении страниц
kk: ❌ Беттерді ауыстыру кезінде қате

source: ❌ Ошибка при скачивании файла
kk: ❌ Файлды жүктеу кезінде қате

source: Произошла ошибка, попробуйте снова.
kk: Қате орын алды, қайта көріңіз.

source: Произошла ошибка. Попробуйте снова.
kk: Қате орын алды. Қайта көріңіз.

source: Сообщение успешно отправлено.
kk: Хабарлама сәтті жіберілді.

source: 📊 Список анализов
kk: 📊 Талдау тізімі

source: 🔄 Повторить анализ
kk: 🔄 Талдауды қайталау

source: 💾 Скачать файл
kk: 💾 Файлды жүктеу

source: 📤 Поделиться
kk: 📤 Бөлісу

source: 🗑 Удалить
kk: 🗑 Жою

source: Мои анализы
kk: Менің талдауларым

source: 📭 Нет анализов для отображения
kk: 📭 Көрсетуге талдау жоқ

source: 📭 *У вас пока нет анализов*
kk: 📭 *Сізде әлі талдау жоқ*

source: 📭 *Анализы не найдены*
kk: 📭 *Талдау табылмады*

source: ❌ Анализ не найден
kk: ❌ Талдау табылмады

source: ❌ Не удалось удалить анализ
kk: ❌ Талдауды жою мүмкін болмады

source: ❌ Сервис истории анализов временно недоступен
kk: ❌ Талдау тарихы сервисі уақытша қолжетімсіз

source: ❌ Произошла ошибка при загрузке анализа
kk: ❌ Талдауды жүктеу кезінде қате

source: ❌ Произошла ошибка при загрузке истории анализов
kk: ❌ Талдау тарихын жүктеу кезінде қате

source: ❌ Произошла ошибка при загрузке списка
kk: ❌ Тізімді жүктеу кезінде қате

source: ❌ Произошла ошибка при загрузке статистики
kk: ❌ Статистиканы жүктеу кезінде қате

source: Подождите, идет Анализ...
kk: Күте тұрыңыз, талдау жүруде...

source: Получен результат анализа
kk: Талдау нәтижесі алынды

source: 💰 Потрачено токенов: {tokens}
kk: 💰 Жұмсалған токендер: {tokens}

source: 📄 Исходный файл анализа
kk: 📄 Бастапқы талдау файлы

source: 📊 *Ваши последние анализы:*
kk: 📊 *Сіздің соңғы талдауларыңыз:*

source: 📊 *История анализов*
kk: 📊 *Талдау тарихы*

source: 📊 *Отфильтрованные анализы:*
kk: 📊 *Сүзілген талдаулар:*

source: 📊 *Подробная статистика*
kk: 📊 *Толық статистика*

source: 📋 *Решение:* {solution}
kk: 📋 *Шешім:* {solution}

source: ❌ *Решение не найдено*
kk: ❌ *Шешім табылмады*

source: 📤 Информация об анализе отправлена
kk: 📤 Талдау туралы ақпарат жіберілді

source: 🔄 Для повторного анализа отправьте файл заново
kk: 🔄 Қайта талдау үшін файлды қайта жіберіңіз

source: 🔄 Файл отправлен для повторного анализа
kk: 🔄 Қайта талдау үшін файл жіберілді

source: 💾 Файл был удален для экономии места
kk: 💾 Орын үнемдеу үшін файл жойылды

source: 💾 Файл отправлен
kk: 💾 Файл жіберілді

source: 🔍 Фильтр
kk: 🔍 Сүзгі

source: 🔍 *Фильтры для истории анализов* Выберите критерий для фильтрации:
kk: 🔍 *Талдау тарихының сүзгілері* Сүзу критерийін таңдаңыз:

source: 📄 *Фильтр по типу файлов* Выберите тип файлов:
kk: 📄 *Файл түрі бойынша сүзгі* Файл түрін таңдаңыз:

source: 📄 По типу файла
kk: 📄 Файл түрі бойынша

source: ✅ Успешные
kk: ✅ Сәтті

source: ❌ Неуспешные
kk: ❌ Сәтсіз

source: 📅 По дате
kk: 📅 Күні бойынша

source: 🔄 Сбросить фильтр
kk: 🔄 Сүзгіні тастау

source: 📄 .ips файлы
kk: 📄 .ips файлдары

source: 📝 .txt файлы
kk: 📝 .txt файлдары

source: 🔧 .json файлы
kk: 🔧 .json файлдары

source: 📭 *Анализы не найдены* По выбранному фильтру анализы не найдены.
kk: 📭 *Талдау табылмады* Таңдалған сүзгі бойынша талдау табылмады.

source: ❌ Ошибка при применении фильтра
kk: ❌ Сүзгіні қолдану кезінде қате

source: 📱 Проанализировать устройство
kk: 📱 Құрылғыны талдау

source: 📊 История анализов
kk: 📊 Талдау тарихы

source: 💰 Пополнить баланс
kk: 💰 Балансты толтыру

source: 📚 Disk directory
kk: 📚 Диск каталогы

source: 🧮 Resistor Calculator
kk: 🧮 Резистор калькуляторы

source: 🌐 Язык / Language
kk: 🌐 Тіл

source: ℹ️ Помощь
kk: ℹ️ Көмек

source: 💰 Ваш текущий баланс: {} токенов.
kk: 💰 Сіздің ағымдағы балансыңыз: {} токен.

source: Баланс токенов
kk: Токен балансы

source: Мой баланс
kk: Менің балансым

source: Пополнить баланс
kk: Балансты толтыру

source: Списан 1 токен (остаток: {balance}).
kk: 1 токен шығарылды (қалған: {balance}).

source: Токен не списан, т.к. готовое решение не найдено в базе.
kk: Токен шығарылмады, өйткені дерекқорда дайын шешім табылмады.

source: Введенной суммы недостаточно для покупки даже 1 токена.
kk: Енгізілген сома тіпті 1 токен сатып алуға жеткіліксіз.

source: Количество токенов должно быть положительным числом.
kk: Токендер саны оң сан болуы керек.

source: Количество токенов должно быть положительным.
kk: Токендер саны оң болуы керек.

source: Не удалось добавить токены. Проверьте логи.
kk: Токендерді қосу мүмкін болмады. Логтарды тексеріңіз.

source: Произошла ошибка при списании токена.
kk: Токенді шығару кезінде қате орын алды.

source: ✅ Пользователю {user_id} добавлено {tokens} токенов. Новый баланс: {new_balance} токенов.
kk: ✅ {user_id} пайдаланушысына {tokens} токен қосылды. Жаңа баланс: {new_balance} токен.

source: ✅ Успешно добавлено {} токенов пользователю {}. Новый баланс: {} токенов.
kk: ✅ {} пайдаланушысына {} токен сәтті қосылды. Жаңа баланс: {} токен.

source: 🎁 Вам начислен ежемесячный бонус: {count} токен!
kk: 🎁 Сізге ай сайынғы бонус берілді: {count} токен!

source: 🎁 Вам начислен ежемесячный бонус: {count} токен. Ваш баланс: {balance} токенов.
kk: 🎁 Сізге ай сайынғы бонус берілді: {count} токен. Сіздің балансыңыз: {balance} токен.

source: 🎉 Вам было начислено {amount} токенов администратором!
kk: 🎉 Сізге әкімші {amount} токен есептеді!

source: 🎉 Вам начислено {} токенов! Ваш новый баланс: {} токенов.
kk: 🎉 Сізге {} токен берілді! Сіздің жаңа балансыңыз: {} токен.

source: 🎉 Ваш баланс пополнен администратором на {tokens} токенов!
kk: 🎉 Сіздің балансыңызды әкімші {tokens} токенге толтырды!

source: 🎁 *Приветственный бонус*: на ваш аккаунт начислено {count} токенов.
kk: 🎁 *Қарсы алу бонусы*: сіздің аккаунтыңызға {count} токен есептелді.

source: 🗓️ *Ежемесячный бонус*: 1-го числа каждого месяца в 00:05 вам будет автоматически начисляться {monthly_count} токен.
kk: 🗓️ *Ай сайынғы бонус*: Әр айдың 1-і 00:05-те сізге автоматты түрде {monthly_count} токен есептеледі.

source: Пригласите друга и получите 2 токена после того, как он зарегистрируется по вашей ссылке.
kk: Досыңызды шақырыңыз және олар сіздің сілтемеңіз арқылы тіркелгеннен кейін 2 токен алыңыз.

source: Неизвестное устройство
kk: Белгісіз құрылғы

source: Неизвестно
kk: Белгісіз

source: Device Information:
kk: Құрылғы туралы ақпарат:

source: 🛠️ Версия iOS:
kk: 🛠️ iOS нұсқасы:

source: 📅 Дата сбоя:
kk: 📅 Апат күні:

source: 📅 Дата анализа: {date}
kk: 📅 Талдау күні: {date}

source: 🔍 Обнаружена ошибка: {error}
kk: 🔍 Қате табылды: {error}

source: 🔍 Ошибка: не определена
kk: 🔍 Қате: анықталмады

source: не определена
kk: анықталмады

source: найдена
kk: табылды

source: Не указана
kk: Көрсетілмеген

source: {device_emoji} *{device}, {ios}* 📄 Файл: {filename} 📅 Дата анализа: {date} 🔍 Обнаружена ошибка: {error}
kk: {device_emoji} *{device}, {ios}* 📄 Файл: {filename} 📅 Талдау күні: {date} 🔍 Қате табылды: {error}

source: 📱 *Device Analysis* 🔧 Устройство: {device} 📅 Дата анализа: {date} 📄 Тип файла: {file_type} 🔍 Результат: {status} Анализ выполнен с помощью @PanicDoctorBot
kk: 📱 *Құрылғы талдауы* 🔧 Құрылғы: {device} 📅 Талдау күні: {date} 📄 Файл түрі: {file_type} 🔍 Нәтиже: {status} Талдау @PanicDoctorBot көмегімен орындалды

source: ✅ Solution found
kk: ✅ Шешім табылды

source: ❌ Solution not found
kk: ❌ Шешім табылмады

source: Найденные ошибки и рекомендации по ремонту:
kk: Табылған қателер және жөндеу бойынша ұсыныстар:

source: Найденные ошибки
kk: Табылған қателер

source: Произошла непредвиденная ошибка при анализе. Администраторы уведомлены.
kk: Талдау кезінде күтпеген қате орын алды. Әкімшілерге хабарландырылды.

source: Пожалуйста, укажите модель диска после команды /disk.
kk: /disk командасынан кейін диск моделін көрсетіңіз.

source: Ошибка: справочник дисков временно недоступен.
kk: Қате: диск анықтамалығы уақытша қолжетімсіз.

source: К сожалению данные по '{model_name}' не найдены.
kk: Өкінішке орай, '{model_name}' деректері табылмады.

source: Нажмите кнопку ниже, чтобы начать поиск дисков:
kk: Дискілерді іздеуді бастау үшін төмендегі түймені басыңыз:

source: Искать диск 🔍
kk: Диск іздеу 🔍

source: Неверный формат. Введите число, например: 4.7 или 150.
kk: Жарамсыз формат. Санды енгізіңіз, мысалы: 4.7 немесе 150.

source: Выберите единицу измерения:
kk: Өлшем бірлігін таңдаңыз:

source: Выберите точность:
kk: Дәлдікті таңдаңыз:

source: Не удалось подобрать цвета для указанного номинала.
kk: Көрсетілген номинал үшін түстерді таңдау мүмкін болмады.

source: Как определить мощность на глаз?
kk: Қуатты көзбен қалай анықтауға болады?

source: <b>Калькулятор SMD-резисторов (Номинал -> Код)</b>
kk: <b>SMD резистор калькуляторы (Номинал -> Код)</b>

source: <b>Калькулятор SMD-резисторов</b>
kk: <b>SMD резистор калькуляторы</b>

source: <b>Итоговые параметры резистора:</b>
kk: <b>Резистордың соңғы параметрлері:</b>

source: Полный ответ больше недоступен или истек срок его хранения.
kk: Толық жауап енді қолжетімсіз немесе оның сақтау мерзімі аяқталды.

source: Полный ответ ⏬
kk: Толық жауап ⏬

source: Пользователь нажал полный ответ
kk: Пайдаланушы толық жауапты басты

source: ⏰ *Повторные круги ограничены* {message} Кнопка повторного анализа будет заблокирована до истечения времени ожидания.
kk: ⏰ *Осы файл үшін қайталау циклдері шектелген* {message} Қайталау талдау түймеші күту уақыты аяқталғанша бұғатталады.

source: ⏰ *Повторные круги ограничены* {message}
kk: ⏰ *Осы файл үшін қайталау циклдері шектелген* {message}

source: 🔄 Круг {current} из 2
kk: 🔄 {current} цикл 2-ден

source: Осталось кругов: {attempts_left}
kk: Осы файл үшін қалған циклдер: {attempts_left}

source: 🔒 Повторный анализ заблокирован
kk: 🔒 Қайталау талдауы бұғатталған

source: Этот файл заблокирован для повторного анализа. Попробуйте снова через {time_left}
kk: Бұл файл қайталау талдауы үшін бұғатталған. {time_left} кейін қайталап көріңіз

source: Достигнут лимит кругов анализа для этого файла ({limit}). Попробуйте снова через 3 часа
kk: Осы файл үшін талдау циклдерінің шегі жеткен ({limit}). 3 сағаттан кейін қайталап көріңіз

source: 🔄 Запускаю повторный анализ...
kk: 🔄 Қайталау талдауын іске қосу...

source: ⏰ Достигнут лимит повторных кругов для этого файла. Анализ будет заблокирован на 3 часа.
kk: ⏰ Осы файл үшін қайталау циклдерінің шегі жеткен. Талдау 3 сағатқа бұғатталады.
